#### TemporaryGraphicsManager Members

---

|  |
| --- |
| TemporaryGraphicsManager Class   Methods   Properties   See Also |

The  TemporaryGraphicsManager  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddControl | Creates an in-canvas control. |
| Public method | Clear | Clear all temporary graphics objects managed by this manager. |
| Public method | Dispose | Releases all resources used by the  TemporaryGraphicsManager |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAll | Returns all temporary graphics object indexes managed by this manager. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method Static member | GetTemporaryGraphicsManager | Gets a TemporaryGraphicsManager reference of the document. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | RemoveControl | Deletes the existing control identified by the unique index. |
| Public method | SetVisibility | Changes the visibility of temporary graphics object. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | UpdateControl | Updates the in-canvas control identified by the unique index. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

TemporaryGraphicsManager Class

Autodesk.Revit.DB Namespace